package com.telegram_bot_for_processing_voice.util;

import lombok.experimental.UtilityClass;

/**
 * Утилитарный класс строк.
 */
@UtilityClass
public class Constants {
    public static final int EXPIRES_IN_TOKEN = 39944;
    public static final String COMMAND_START = "/start";
    public static final String COMMAND_HELP = "/help";
    public static final String COMMAND_EXAMPLE = "/example";
    public static final String WELCOME_MESSAGE = """
                👋 Привет, %s!
                
                Я бот для формирования статистики футбольных игроков.
                Подсчитываю действия игроков: перехваты, передачи, обводки, отборы.
                Отправляю отчет в Excel/XML формате.
                
                **Доступные команды:**
                %s - показать справку
                %s - Пример использования
                
                Просто отправьте голосовое или обычного сообщение, и я начну работу! 🎤
                """;

    public static final String HELP_MESSAGE = """
                🤖 **Помощь по использованию бота**
                
                **Как это работает:**
                1. Отправьте мне голосовое сообщение
                2. Я скачаю и обработаю его
                3. Преобразую речь в excel талицу
                4. Отправлю вам результат
                
                **Доступные команды:**
                %s - Начать работу
                %s - Пример использования
                
                **Поддерживаемые языки:**
                • Русский (ru-RU)
                
                **Ограничения:**
                • Максимальная длина: 30 сек
                • Формат: OGG (стандартный для Telegram)
                
                Начните с отправки голосового или обычного сообщения! 🎤
                """;

    public static final String EXAMPLE_MESSAGE = """
                Пример использования!
               
               "Анкинфеев передача Aршивин обводка Дзюба перехват Титов отбор Дзюба отбор".
                Действия всего 4: передача, обводка, перехват, отбор.
               
                **Доступные команды:**
                %s - Начать работу
                %s - показать справку
               
                Начните с отправки голосового или обычного сообщения! 🎤
               """;
}
